Repository: pancakevirus/nim-lang-081-docs-archived
Catalog: docs/OmegaT/OmegaT-level2.tmx
Source language: en_us
Languages: ja

source: Checks if a string is an IP address Returns true if it is, false otherwise Source Edit
ja: Checks if a string is an IP address Returns true if it is, false otherwise ソース 編集

source: Checks if the directory dir exists.
ja: ディレクトリ dir の存在を確認します。

source: Checks if the file exists.
ja: ファイルの存在を確認します。

source: Checks if two MD5Digest values are identical.
ja: 双方の MD5Digest 値が同一値であるか確認します。

source: Checks if two SecureHash values are identical.
ja: 双方の SecureHash 値が同一値であるか確認します。

source: Clients can also use Postgres keyword/value connection strings to connect.
ja: クライアントでも Postgres キーワード・値の文字列を接続で使えます。

source: Close database connection
ja: データベースの接続終了

source: Close stream
ja: ストリームを閉じる

source: Close.
ja: 閉じられた。

source: Closes a channel c and frees its associated resources.
ja: チャンネル c を閉じて関連リソースを開放します。

source: Closes the database connection.
ja: データベースの接続を終了します。

source: Closes the file specified.
ja: 指定されたファイルを閉じます。

source: Closes the file.
ja: ファイルを閉じます。

source: Closures
ja: クロージャー

source: Code generation for closures
ja: クロージャーのコード生成

source: Code owners
ja: コードの権利所有者

source: CodegenDecl pragma
ja: CodegenDecl プラグマ

source: Coding Guidelines
ja: コーディングのガイドライン

source: Coding conventions: ALL types are named the same as in the POSIX standard except that they start with 'T' or 'P' (if they are pointers) and without the '_t' suffix to be consistent with Nim conventions.
ja: コーディング規約: 接頭辞が 'T' または 'P' (ポインタの場合) 以外、および Nim 記法と整合性を取るために接尾辞は '_t' (構造体) であることを除き、型名はすべて POSIX 標準規格と準拠します。

source: Collections
ja: コレクション

source: Command line switches
ja: コマンドラインスイッチ

source: Command:
ja: コマンド:

source: Commands
ja: コマンド

source: Comments
ja: コメント

source: Common datatypes and definitions for all db_*.nim ( db_mysql, db_postgres, and db_sqlite) modules.
ja: db_*.nim ( db_mysql, db_postgres, および db_sqlite) モジュールにおける共通データ型と定義です。

source: Compare two Mongo Object IDs for equality Source Edit
ja: 相等性を確認するために Mongo オブジェクト ID 同士の比較をします ソース 編集

source: Compare two complex numbers x and y for equality.
ja: 複素数 x と y が等しいか比較します。

source: Compares a and b ignoring case.
ja: 英数大小同一視で a と b を比較します。

source: Compares two colors.
ja: ２色同士を比較します。

source: Compares two strings in a case insensitive manner.
ja: 英数大小文字同一視で文字列同士を比較します。

source: Compilation to JavaScript
ja: JavaScript へのコンパイル

source: Compile nimgrep with the command:
ja: このコマンドで nimgrep をコンパイルします。

source: Compile pragma
ja: Compile プラグマ

source: Compile time symbols
ja: コンパイル時のシンボル

source: Compiler
ja: コンパイラ

source: Compiler Messages
ja: コンパイラメッセージ

source: Compiler Selection
ja: コンパイラの選択

source: Compiler Usage
ja: コンパイラの用法

source: Compiling the compiler is a simple matter of running:
ja: コンパイラをコンパイルするには簡単なコマンドを実行します。

source: Completes a FutureStream signalling the end of data.
ja: データ終端信号を送信して FutureStream を完了します。

source: Complex number x raised to the power y.
ja: 複素数 x を y 乗で累乗します。

source: Complex numbers are currently implemented as generic on a 64-bit or 32-bit float.
ja: 現在、複素数は一般的な 64-bit または 32-bit float として実装されています。

source: Comprehension for seq/set/table collections.
ja: seq/set/table コレクションを読み取ります。

source: Compute the hash for a JSON node Source Edit
ja: Compute the hash for a JSON node ソース 編集

source: Compute the hash for a SEXP node Source Edit
ja: SEXP ノードのハッシュを算出します ソース 編集

source: Computes an MD5 value of s and returns its string representation.
ja: s の MD5 値を算出して文字列形式で返します。

source: Computes hash for rational x Source Edit
ja: Computes hash for rational x ソース 編集

source: Computes the MD5Digest value for a string s.
ja: 文字列 s の MD5Digest 値を算出します。

source: Concatenation operator for JavaScript strings Source Edit
ja: Concatenation operator for JavaScript strings ソース 編集

source: Concrete syntax:
ja: 具象構文:

source: Config section
ja: Config セクション

source: Configuration file
ja: コンフィギュレーション・ファイル

source: Configuration files
ja: コンフィギュレーション・ファイル

source: Configures stdin, stdout and stderr to be unbuffered.
ja: stdin, stdout, および stderr をバッファリングなしへ設定します。

source: Conjugate of complex number z.
ja: 共役複素数 z です。

source: Connect to the FTP server specified by ftp.
ja: ftp で指定された FTP サーバーへ接続します。

source: Connecting to an FTP server
ja: FTP サーバーへの接続

source: Const section
ja: Const セクション

source: Constants
ja: 定数

source: Constants and Constant Expressions
ja: 定数と定数式

source: Constructor macro for XML.
ja: XML のコンストラクタ・マクロです。

source: Constructs a color from RGB values.
ja: RGB 値からカラーを構成します。

source: Consts
ja: 定数

source: Continue statement
ja: Continue ステートメント

source: Control flow statements
ja: 制御流れステートメント

source: Controls the behaviour of the script.
ja: スクリプトの動作を制御します。

source: Convert an expression to a SexpNode directly, without having to specify % for every element.
ja: 要素ごとに % を指定することなく、式を SexpNode へ変換します。

source: Convert the Windows file time timestamp t to FILETIME.
ja: Windows ファイルのタイムスタンプ時刻 t を FILETIME へ変換します

source: Converter declaration
ja: コンバータ宣言

source: Converters
ja: コンバータ

source: Converts n into its string representation.
ja: n を文字列形式へ変換します。

source: Converts node to its SEXP Representation on one line.
ja: node を Sexp の一行形式へ変換します。

source: Converts node to its Sexp Representation, with indentation and on multiple lines.
ja: インデントと複数行分割により、 node を Sexp 形式へ変換します。

source: Converts s to a HtmlTag.
ja: s を HtmlTag へ変換します。

source: Converts {key: value} pairs into XmlAttributes.
ja: {key: value} のペアを XmlAttributes へ変換します。

source: Converts a MD5Digest value into its string representation.
ja: MD5Digest 値を文字列形式へ変換します。

source: Converts a color into its textual representation.
ja: カラー値をカラー名表記へ変換します。

source: Converts a string hash to SecureHash.
ja: 文字列 hash を SecureHash へ変換します。

source: Converts a string s to its JSON representation.
ja: 文字列 s を JSON 形式へ変換します。

source: Converts a value of any type to type JsObject Source Edit
ja: Converts a value of any type to type JsObject ソース 編集

source: Converts an HTML entity name like &Uuml; or values like &#220; or &#x000DC; to its UTF-8 equivalent.
ja: &Uuml; などの HTML エンティティ名、または &#220; や &#x000DC; などの値を UTF-8 へ等価変換します。

source: Converts an IpAddress into the textual representation Source Edit
ja: Converts an IpAddress into the textual representation ソース 編集

source: Converts an SQL abstract syntax tree to its string representation.
ja: SQL 抽象構文木を文字列形式へ変換します。

source: Converts between different character encodings.
ja: 異種文字エンコーディング間での変換を行います。

source: Copies a file from source to dest.
ja: ファイルを source から dest へコピーします。

source: Copies the dir from to to.
ja: ディレクトリを from から to へコピーします。

source: Copies the file from to to.
ja: ファイルを from から to へコピーします。

source: Core
ja: コア

source: CoroutineRef holds a pointer to actual coroutine object.
ja: CoroutineRef は実在する coroutine (コルーチン) オブジェクトのポインタを保持します。

source: Create a new FutureStream.
ja: 新しい FutureStream を作成します。

source: Create a new empty heap.
ja: 空のヒープを新規作成します。

source: Create and initialize inotify instance.
ja: inotify インスタンスの作成と初期化をします。

source: Creates AsyncFile with a previously opened file descriptor fd.
ja: 以前に開いたファイルディスクリプタ fd で AsyncFile を作成します。

source: Creates n processes that execute in parallel.
ja: 並列実行用のプロセスを n 本作成します。

source: Creates a File from a filehandle with given mode.
ja: mode を指定して filehandle から File を作成します。

source: Creates a command in the format of Set-Cookie: key=value; Domain=...; ... Source Edit
ja: Set-Cookie: key=value; Domain=...; ... 形式のコマンドを作成します。 ソース 編集

source: Creates a directory dir.
ja: ディレクトリ dir を作成します。

source: Creates a new AsyncFtpClient object.
ja: 新しい AsyncFtpClient オブジェクトを作成します。

source: Creates a new AsyncHttpServer instance.
ja: 新しい AsyncHttpServer インスタンスを作成します。

source: Creates a new AsyncSmtp instance.
ja: 新しい AsyncSmtp インスタンスを作成します。

source: Creates a new JArray JsonNode Source Edit
ja: Creates a new JArray JsonNode ソース 編集

source: Creates a new JObject JsonNode Source Edit
ja: Creates a new JObject JsonNode ソース 編集

source: Creates a new SCons SexpNode Source Edit
ja: 新しい SCons SexpNode を作成します ソース 編集

source: Creates a new SFloat SexpNode.
ja: 新しい SFloat SexpNode を作成します。

source: Creates a new SInt SexpNode.
ja: 新しい SInt SexpNode を作成します。

source: Creates a new SList SexpNode Source Edit
ja: 新しい SList SexpNode を作成します ソース 編集

source: Creates a new SNil SexpNode.
ja: 新しい SNil SexpNode を作成します。

source: Creates a new SString SexpNode.
ja: 新しい SString SexpNode を作成します。

source: Creates a new SSymbol SexpNode with value t or SNil SexpNode.
ja: SSymbol SexpNode による値 t または SNil SexpNodeを新規作成します。

source: Creates a new Smtp instance.
ja: 新しい Smtp インスタンスを作成します。

source: Creates a new SqlPrepared statement.
ja: 新しい SqlPrepared ステートメントを作成します。

source: Creates a new XmlNode of kind xnCData with the text cdata.
ja: テキスト cdata で xnCData と同種の XmlNode を新規作成します。

source: Creates a new XmlNode of kind xnComment with the text comment.
ja: テキスト comment で xnComment と同種の XmlNode を新規作成します。

source: Creates a new XmlNode of kind xnElement with the given tag.
ja: 指定された tag で xnElement と同種の XmlNode を新規作成します。

source: Creates a new XmlNode of kind xnEntity with the text entity.
ja: テキスト entity で xnEntity と同種の XmlNode を新規作成します。

source: Creates a new XmlNode of kind xnText with the text text.
ja: テキスト text で xnText と同種の XmlNode を新規作成します。

source: Creates a new MIME compliant message.
ja: MIME 準拠メッセージを新規作成します。

source: Creates a new Mimetypes database.
ja: 新しい Mimetypes データベースを作成します。

source: Creates a new XML tree with tag, children and attributes.
ja: tag, children および attributes で XML ツリーを新規作成します。

source: Creates a new empty JsObject Source Edit
ja: Creates a new empty JsObject ソース 編集

source: Creates a new selector Source Edit
ja: Creates a new selector ソース 編集

source: Creates a new stream from the file f.
ja: 新しいストリームをファイル f から作成します。

source: Creates a new thread t and starts its execution.
ja: 新しいスレッド t を作成して実行を開始します。

source: Creates a unique temporary directory from a prefix string.
ja: 接頭辞となる文字列 (prefix) から唯一無二の一作業用ディレクトリを作成します。

source: Creates a unique temporary file from a prefix string.
ja: 接頭辞となる文字列 (prefix) から唯一無二の一作業用ファイルを作成します。

source: Creates a unique temporary file.
ja: 唯一無二の一作業用ファイルを作成します。

source: Creates the directory dir.
ja: ディレクトリ dir を作成します。

source: Creates the directory dir including all necessary subdirectories.
ja: 必要ならばサブディレクトリ込みでディレクトリ dir を作成します。

source: Creating a table
ja: テーブルの作成

source: Cross compilation
ja: クロスコンパイル

source: Cross compilation for Android
ja: Android 用のクロスコンパイル

source: Cross compilation for Nintendo Switch
ja: Nintendo Switch 用のクロスコンパイル

source: Cross compilation for Windows
ja: Windows 用のクロスコンパイル

source: Cross compilation for iOS
ja: iOS 用のクロスコンパイル

source: Currently all queries are ANSI calls, not Unicode.
ja: 現在、クエリは Unicode ではなく、 ANSI による呼び出し形式です。

source: Currently it can create an installer for Windows via Inno Setup as well as installation/deinstallation scripts for UNIX.
ja: 現在、UNIX 用のインストール・アンインストールスクリプト、 Inno Setup により Windows 用のインストーラを作成できます。

source: Currently not implemented for ODBC.
ja: 現在、 ODBC では実装されていません。

source: Currently only few languages are supported, other languages may be added.
ja: 現在、数種類の言語をサポートしています。今後、サポート言語を増やしていく予定です。

source: Currently the database parameter is ignored, but included to match open() in the other db_xxxxx library modules.
ja: 現在、 database パラメータは db_xxxxx ライブラリモジュールの open() との整合性を得るためにあり、このモジュールでは無視されます。

source: DB quotes the string.
ja: データベースで使う文字列のクォート処理を行います。

source: DER encoded certificate Source Edit
ja: DER encoded certificate ソース 編集

source: DLL generation
ja: DLL の生成

source: DO NOT call tcc_relocate() before.
ja: tcc_relocate() の前に呼び出してはいけません。

source: Dark Mode
ja: 消灯

source: Database support
ja: データベースサポート

source: Debug Example
ja: デバッグの用例

source: Debugging the compiler
ja: コンパイラのデバッグ

source: Declaration of the Document Object Model for the JavaScript backend.
ja: JavaScript バックエンド で使えるドキュメント・オブジェクト・モデル (DOM: Document Object Model) の宣言です。

source: Decode a Punycode-encoded string Source Edit
ja: Punycode エンコード文字列のデコードをします ソース 編集

source: Decodes string s in base64 representation back into its original form.
ja: Base64 形式の文字列 s をデコードして元形式へ復元します。

source: Decoding data
ja: データのデコード

source: Default FTP onProgressChanged handler.
ja: onProgressChanged は FTP におけるデフォルトのハンドラです。

source: Default Nim sort (an implementation of merge sort).
ja: デフォルトの Nim ソートです (マージソートの実装)。

source: Default mode is readonly.
ja: デフォルトのモードは読み取り専用 (readonly) です。

source: Default value is 5ms.
ja: デフォルト値は 5ms です。

source: Default values
ja: デフォルト値

source: Defer statement
ja: Defer ステートメント

source: Define the symbol ignoreAllocationSize so that only the number of allocations is counted and the sizes of the memory allocations do not matter.
ja: ignoreAllocationSize シンボルを定義すると割り当て数の計測のみとなり、メモリの割り当てサイズは計測しません。

source: Defines a task.
ja: タスクを定義します。

source: Definitions
ja: 定義

source: Delete a directory dir on the remote FTP server Source Edit
ja: リモート FTP サーバーのディレクトリ dir を削除します ソース 編集

source: Delete a file filename on the remote FTP server Source Edit
ja: リモート FTP サーバーのファイル filename を削除します ソース 編集

source: Delete the i'th child of n.
ja: n にある i 番目の子を削除します。

source: Delete the header entries associated with key Source Edit
ja: Delete the header entries associated with key ソース 編集

source: Deletes the environment variable named key.
ja: key で指名された環境変数を削除します。

source: Deprecated
ja: 廃止

source: Describes for interpolatedFragments which part of the interpolated string is yielded; for example in "str$$$var${expr}" Source Edit
ja: Describes for interpolatedFragments which part of the interpolated string is yielded; for example in "str$$$var${expr}" ソース 編集

source: Describes the type of an IP address Source Edit
ja: Describes the type of an IP address ソース 編集

source: Description of some tools that come with the standard distribution.
ja: 標準ディストリビューションに付属のツールについて説明してあります。

source: Determines whether file exists.
ja: file が存在するかどうか判定します。

source: Different kinds of XML nodes.
ja: 各種 XML ノードです。

source: Directory structure
ja: ディレクトリ構造

source: Directory.
ja: ディレクトリ。

source: Disable true color.
ja: トゥルーカラーを無効にします。

source: Disables or enables a specific hint.
ja: 指定されたヒントの有効・無効化を行います。

source: Disables or enables a specific warning.
ja: 指定された警告の有効・無効化を行います。

source: Discard statement
ja: Discard ステートメント

source: Disconnects from the SMTP server and closes the socket.
ja: SMTP サーバーから切断してソケットを閉じます。

source: Displays compilation of all the compiled files, including those imported by other modules or through the compile pragma.
ja: ほかのモジュール、または compile プラグマによるインポートなどコンパイルを行ったファイルのコンパイル状況を表示します。

source: Displays compilation statistics, enumerates the dynamic libraries that will be loaded by the final binary and dumps to standard output the result of applying a filter to the source code if any filter was used during compilation.
ja: コンパイルの統計表示、完成版のバイナリでロードされる動的ライブラリの一覧表示、およびコンパイル中にフィルタが使用されたときはソースコードのフィルタの適用結果を標準出力へダンプします。

source: Distinct type
ja: 特異型

source: Distro/OS detection.
ja: ディストリビューション / OS を検出します。

source: Divide x by y in place.
ja: x を y の桁で除算します。

source: Divide x by y.
ja: x を y で除算します。

source: Divide complex number x by real number y.
ja: 複素数 x を実数 y で除算します。

source: Divide real number x by complex number y.
ja: 実数 x を複素数 y で除算します。

source: Do not follow a sym link.
ja: シンボリックリンクを辿らないようにします。

source: Do not import it directly.
ja: 明示的にインポートしないでください。

source: Do not import it explicitly.
ja: 明示的にインポートしないでください。

source: Do yourself a favor and import the module as from htmlgen import nil and then fully qualify the macros.
ja: 悪いことは言いません。 from htmlgen import nil でモジュールをインポート後にマクロで完全修飾してください。

source: Document Types
ja: ドキュメント形式

source: Documentation Comments
ja: ドキュメンテーションのコメント

source: Documentation section
ja: Documentation セクション

source: Documents: API naming design, Code owners, Contributing, DrNim User Guide, Embedded Stack Trace Profiler (ESTP) User Guide, Hot code reloading, Internals of the Nim Compiler, Nim Backend Integration, Nim Compiler User Guide, Nim Destructors and Move Semantics, Nim DocGen Tools Guide, Nim Documentation Overview, Nim Enhancement Proposal #1 - Standard Library Style Guide, Nim Experimental Features, Nim IDE Integration Guide, Nim IDE Integration Guide, Nim maintenance script, Nim Manual, Nim Standard Library, Nim Tutorial (Part I), Nim Tutorial (Part II), Nim Tutorial (Part III), Nim's Memory Management, nimgrep User's manual, niminst User's manual, NimScript, Packaging Nim, Source Code Filters, Tools available with Nim.
ja: ドキュメント: API 命名仕様書、コードの権利所有者、寄贈について、DrNim ユーザガイド、組み込みスタックトレースプロファイラ (ESTP) ユーザガイド、ホットコード・リローディング、Nim コンパイラの内部構造、Nim バックエンドシステム統合、Nim コンパイラ ユーザガイド、Nim デストラクタと Move セマンティクス、Nim DocGen ツールガイド、Nim ドキュメンテーションの概要、Nim 拡張提案書 #1 - 標準ライブラリのスタイルガイド、Nim の試験的機能、Nim IDE システム統合ガイド (idetools)、Nim IDE システム統合ガイド (nimsuggest)、Nim メンテナンス・スクリプト、Nim マニュアル、Nim 標準ライブラリ、Nim チュートリアル (第１部)、Nim チュートリアル (第２部)、Nim チュートリアル (第３部)、Nim のメモリ管理、nimgrep ユーザーズ・マニュアル、niminst ユーザーズ・マニュアル、NimScript、Nim のパッケージング、ソースコードフィルタ、Nim で使えるツール。

source: Docutils
ja: ドキュメンテーションのユーティリティ

source: Does nothing.
ja: それ以外の用途はありません。

source: Doesn't block.
ja: ブロックはできません。

source: Doing so may result in zombie processes and pty leaks.
ja: これはゾンビ・プロセスや疑似端末リーク (pty leak) の原因となります。

source: Download of files.
ja: ファイルのダウンロード。

source: Downloads file and saves it to dest.
ja: file をダウンロードして dest へ保存します。

source: Dumps statistics about the Garbage Collector.
ja: ガーベジ・コレクターの統計をダンプ。

source: Dumps the content of an expression, useful for debugging.
ja: 式の内容をダンプして、デバッグで使えるようにします。

source: E.g. -p:PATH.
ja: 例えば -p:パス とします。

source: EOF and no more data Source Edit
ja: EOF and no more data ソース 編集

source: EOF detected Source Edit
ja: EOF detected ソース 編集

source: Each Base64 digit represents exactly 6 bits of data.
ja: Base64 の各桁は必ず 6 bit データ表現になります。

source: Each commonly used HTML tag has a corresponding macro that generates a string with its HTML representation.
ja: 一般的によく使われる HTML タグ と対応するマクロを使うことで HTML 表記の文字列を生成します。

source: Each hint can be activated individually with --hint[NAME]:on|off or in a push pragma.
ja: ヒントは --hint[名前]:on|off または push プラグマで個別に有効化できます。

source: Each system/shell may feature different escaping rules, so try to avoid this kind of shell invocation if possible as it leads to non portable software.
ja: システムやシェルごとにエスケープ処理のルールが異なります。可能であれば、ソフトウェアの移植性を損なわないために、この方式でのシェル呼び出しは避けてください。

source: Each warning can be activated individually with --warning[NAME]:on|off or in a push pragma.
ja: 警告は --warning[名前]:on|off または push プラグマで個別に有効化できます。

source: Ease of use is measured by the number of calls to achieve a concrete high level action.
ja: 実際の高水準動作による呼び出し回数の計測値を使いやすさの指標としています。

source: Echoes styles arguments to stdout using styledWriteLine.
ja: styledWriteLine を用いて標準出力へ style 引数をエコーします。

source: Effect that denotes a read from an environment variable.
ja: 環境変数の読み取りを意味するエフェクト。

source: Effect that denotes a read operation from the directory structure.
ja: ディレクトリ構造の読み取り操作を意味するエフェクト。

source: Effect that denotes a write operation to the directory structure.
ja: ディレクトリ構造の書き込み操作を意味するエフェクト。

source: Effect that denotes a write to an environment variable.
ja: 環境変数の書き込みを意味するエフェクト。

source: Else it returns 0.
ja: それ以外は 0 を返します。

source: Embedded Stack Trace Profiler (ESTP) User Guide
ja: 組み込みスタックトレースプロファイラ (ESTP) ユーザガイド

source: Emit pragma
ja: Emit プラグマ

source: Enable true color.
ja: トゥルーカラーを有効にします。

source: Enabled with --threads:on.
ja: --threads:on で有効になります。

source: Encapsulates a database connection.
ja: データベース接続のカプセル化

source: Encode a string that may contain Unicode.
ja: Unicode 文字列のエンコードをします。

source: Encodes s into base64 representation as lines.
ja: s を Base64 の一行形式としてエンコードします。

source: Encodes s into base64 representation.
ja: Base64 形式で s をエンコードします。

source: Encodes a value to be XML safe:
ja: 安全な XML にするために値をエンコードします:

source: Encoding
ja: エンコーディング

source: Encoding data
ja: データのエンコード

source: English word
ja: 英名表記

source: Entry point is the proc tp.
ja: エントリポイントは tp プロシージャです。

source: Enumeration specifying a path component.
ja: パス構成の指定に使う列挙型です。

source: Enumerations
ja: 列挙型

source: Erases the entire current line.
ja: 現在の行をまるごと抹消します。

source: Erases the screen with the background colour and moves the cursor to home.
ja: 画面を背景表示色で消去後にカーソルを復帰位置へ移動します。

source: Erik O'Leary
ja: エリック・オライリー

source: Error, data contains errno Source Edit
ja: Error, data contains errno ソース 編集

source: Escape sequence
ja: エスケープシーケンス

source: Escapes s for inclusion into an XML document.
ja: XML ドキュメントへ挿入するために s をエスケープします。

source: Escapes the ' (single quote) char to ''.
ja: '' で ' (シングルクォート) 文字をエスケープ処理します。

source: Escapes these characters:
ja: エスケープ対象の文字:

source: Establishes a connection with a SMTP server.
ja: SMTP サーバーとの接続を確立します。

source: Euler's number Source Edit
ja: Euler's number ソース 編集

source: Event occurred against dir.
ja: イベントがディレクトリで発生した。

source: Event queued overflowed.
ja: イベントキューがオーバーフローした。

source: Event Source Edit
ja: イベント ソース 編集

source: Every occurred parsing error is added to the errors sequence.
ja: 構文解析エラーの発生時に errors シーケンスへ追加します。

source: Every tag in the resulting tree is in lower case.
ja: ツリーにある全タグは小文字になります。

source: Example
ja: 用例

source: Example for startTls use:
ja: startTls での用例:

source: Example gmail use:
ja: Gmail での用例:

source: Example outputs: {keyA: value, keyB: value}, {:} If T is void the outputs look like: {keyA, keyB}, {}.
ja: 出力例: {keyA: value, keyB: value}, {:} T が void ならば出力は: {keyA, keyB}, {}.

source: Example results file
ja: 分析結果のファイル出力例

source: Example usage:
ja: 用例:

source: Example:
ja: 用例:

source: Example: InnoSetup: "Yes"
ja: 用例: InnoSetup: "Yes"

source: Example: InstallScript: "Yes"
ja: 用例: InstallScript: "Yes"

source: Example: UninstallScript: "Yes"
ja: 用例: UninstallScript: "Yes"

source: Example: flags = "-w"
ja: 用例: flags = "-w"

source: Example: flags = "/Q"
ja: 用例: flags = "/Q"

source: Example: path = r"c:\inno setup 5\iscc.exe"
ja: 用例: path = r"c:\inno setup 5\iscc.exe"

source: Example: BinPath: r"bin;dist\mingw\bin"
ja: 用例: BinPath: r"bin;dist\mingw\bin"

source: Example: Lifting Procs
ja: 用例: Lifting Procs

source: Example: Transforming hyperlinks
ja: 用例: ハイパーリンクの変換

source: Examples
ja: 用例

source: Examples:
ja: 用例:

source: Exception handling
ja: 例外処理

source: Exception that is raised for invalid XML.
ja: 不正な XML で発生する例外です。

source: Exceptions
ja: 例外

source: Exclude events on unlinked objects.
ja: イベントから削除 (unlink) されたオブジェクトを除外します。

source: Excluding symbols
ja: シンボルの除外

source: Execute SQL query
ja: SQL クエリの実行

source: Executes command and returns its error code.
ja: command の実行後にエラーコードを返します。

source: Executes an external command with the current nim/nimble executable.
ja: 現在の nim/nimble 実行可能ファイルから外部コマンドを実行します。

source: Executes an external process.
ja: 外部プロセスを実行します。

source: Executes the commands cmds in parallel.
ja: コマンド cmds を並列実行します。

source: Executes the query (typically "INSERT") and returns the generated ID for the row or -1 in case of an error.
ja: クエリを実行後 (通常は "INSERT") に行の生成 ID、あるいはエラーならば -1 返します。

source: Executes the query (typically "INSERT") and returns the generated ID for the row.
ja: クエリを実行後 (通常は "INSERT") に行の生成 ID を返します。

source: Executes the query (typically "UPDATE") and returns the number of affected rows.
ja: クエリを実行後 (通常は "UPDATE") に処理対象となった行数を返します。

source: Executes the query and iterates over the result dataset.
ja: クエリを実行した結果をデータセットとしてイテレートします。

source: Executes the query and raises EDB if not successful.
ja: クエリを実行します。失敗したときは EDB が発生します。

source: Executes the query and raises a DbError exception if not successful.
ja: クエリを実行します。失敗したときは DbError 例外が発生します。

source: Executes the query and returns the first column of the first row of the result dataset.
ja: クエリを実行した結果としてデータセットの最初の行にある最初の列を返します。

source: Executes the query and returns the whole result dataset.
ja: クエリを実行した結果をデータセット全体として返します
